Autodesk.Revit.DB.Architecture.RailSupportsLayout
The layout of the rail supports.
Since:
2013

Autodesk.Revit.DB.Architecture.RailSupportsLayout.MinSpacing
The rail supports are laid out with a minimum spacing.

Autodesk.Revit.DB.Architecture.RailSupportsLayout.MaxSpacing
The rail supports are laid out with a maximum spacing.

Autodesk.Revit.DB.Architecture.RailSupportsLayout.FixedNumber
The rail supports are laid out with a specified fixed number.

Autodesk.Revit.DB.Architecture.RailSupportsLayout.AlignWithRailingPosts
The rail supports are laid out aligned with the railing posts.

Autodesk.Revit.DB.Architecture.RailSupportsLayout.FixedDistance
The rail supports are laid out on a fixed distance spacing.

Autodesk.Revit.DB.Architecture.RailSupportsLayout.None
No rail support.